Конфигурация/InformationRegisters/ИнвестиционныеПрофили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИнвестиционныеПрофили</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвеcтиционныеЦели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантГоризонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИнвестиционногоГоризонта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПериодаГоризонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПериодаГоризонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтносительныйСрокГоризонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВариантыИнвестиционногоГоризонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыИнвестиционногоГоризонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнтервалДат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЛетСДатыЗаключенияДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЛетСДатыРегистрацииПрофиля</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/ИнвестиционныеПрофили/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ВариантГоризонта = Перечисления.ВариантыИнвестиционногоГоризонта.ИнтервалДат Тогда
			Если НЕ ЗначениеЗаполнено(Запись.НачалоПериодаГоризонта) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата начала периода горизонта для инвестиционного профиля по '" + Запись.СубъектУчета + "'!",,,, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Запись.ОкончаниеПериодаГоризонта) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата окончания периода горизонта для инвестиционного профиля по '" + Запись.СубъектУчета + "'!",,,, Отказ);
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(Запись.ОтносительныйСрокГоризонта) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен относительный срок горизонта для инвестиционного профиля по '" + Запись.СубъектУчета + "'!",,,, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	РегистрыСведений.ИнвестиционныеПрофили.КонтрольПовышенияДопустимогоРискаПоСтандартнымСтратегиям(Отказ);
	
КонецПроцедуры
